testing/share/Testing/test_data/SimpleStatic/fluid/constant/couplingProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      couplingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatch fsiFace;
solidZone plateZone;

fluidPatch fsiFace;
fluidZone plateZone;

//movingRegion region0;

// Original
//fsiRelaxationFactor 0.99;
//couplingScheme Aitken;
// Original End

// Masoud
fsiRelaxationFactor 0.01;
//couplingScheme FixedRelaxation;
couplingScheme Aitken;
// Masoud End

interfaceDeformationLimit 1.0e-2;

outerCorrTolerance 1e-4;


fsi yes;

// ************************************************************************* //
